{
  "architectures": [
    "BitnetForCausalLM"
  ],
  "model_type": "llama",
  "vocab_size": 49152,
  "hidden_size": 576,
  "intermediate_size": 1536,
  "num_hidden_layers": 30,
  "num_attention_heads": 9,
  "num_key_value_heads": 3,
  "head_dim": 64,
  "hidden_act": "silu",
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-05,
  "use_cache": true,
  "rope_theta": 100000.0,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "eos_token_id": 2,
  "bos_token_id": 1,
  "pad_token_id": 0,
  "quantization_config": {
    "quant_method": "bitnet_ternary",
    "bits": 2,
    "group_size": 128
  }
}